Autodesk.Revit.DB.Structure.AlignedDistributionRebarHandles
This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Aligned Distribution have.
The tag of a Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle RebarConstrainedHandle
can be obtained by calling the Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()
Since:
2026
Since:
2026

Autodesk.Revit.DB.Structure.AlignedDistributionRebarHandles.SetOrientation
Tag for handle representing the Set Orientation. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.AlignedDistributionRebarHandles.EndOfDistributionPath
Tag for handle representing the End Distribution Path. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.AlignedDistributionRebarHandles.StartOfDistributionPath
Tag for handle representing the Start Distribution Path. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.AlignedDistributionRebarHandles.DistributionPath2
Tag for handle representing the Distribution Path 2. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.AlignedDistributionRebarHandles.DistributionPath1
Tag for handle representing the Distribution Path 1. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.AlignedDistributionRebarHandles.HostSurface
Tag for handle representing the Host Surface. This handle accepts constraints only to host faces or to covers.